Revit 2026 API

# ElementIsModifiable Property

---

Identifies if the element is modifiable.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsModifiable { get; }
```
```vb
Public ReadOnly Property IsModifiable As Boolean
	Get
```
```cpp
public:
property bool IsModifiable {
	bool get ();
}
```
```fsharp
member IsModifiable : bool with get
```

#### Property Value

Boolean

This is not a permanent state. The value depends on the document state. For example, active edit modes can make IsModifiable false for many elements.

#### Reference

Element Class

Autodesk.Revit.DB Namespace